feat: Update MiniMax to M2.7-highspeed
